# RemoveCalloutParent Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
View..::..RemoveCalloutParent Method
View Class See Also
---
Replaces callout parent ID with InvalidElementId.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public void RemoveCalloutParent()
```

Visual Basic
---
```text
Public Sub RemoveCalloutParent
```

Visual C++
---
```text
public:
void RemoveCalloutParent()
```

# Remarks
Nothing is done if the callout has already no parent.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..InvalidOperationException | This view is not a callout. |

# See Also
View Class
Autodesk.Revit.DB Namespace